{
  "state": "Tennessee",
  "lastReviewedUTC": "2025-10-06T18:00:00Z",
  "atAGlance": {
    "mustRegister": "Anyone convicted of a qualifying sexual offense (or equivalent from another jurisdiction) who lives, works, or studies in Tennessee must register within 48 hours of establishing residence, employment, or enrollment. See [TCA §40-39-203](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-203/).",
    "initialDeadline": "48 hours to register after establishing presence (excluding weekends and holidays).",
    "verificationCadence": "Violent sexual offenders: quarterly (March, June, September, December). Other sexual offenders: annually within 7 days before or after birthday.",
    "primaryMethod": "In-person reporting with local law enforcement; data entered into the TBI registry. Fingerprints, palm prints, and photographs required.",
    "topGotchas": [
      "Homeless offenders must report monthly.",
      "All changes (address, job, school, phone, email) must be updated within 48 hours.",
      "Creating or changing online usernames or emails must be reported within 3 days.",
      "Failure to register or update is a felony."
    ],
    "officialLinks": {
      "tbiRegistry": "https://www.tn.gov/tbi/divisions/cjis-division/tennessee-sex-offender-registry.html",
      "statuteIndex": "https://law.justia.com/codes/tennessee/title-40/chapter-39/",
      "publicSearch": "https://apps.tn.gov/sexoffender/"
    }
  },

  "whoMustRegister": "Individuals convicted of any qualifying sexual offense listed under [TCA §40-39-202(20)](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-202/), including offenses against minors, sexual battery, rape, child exploitation, and federal or out-of-state equivalents.",

  "deadlinesReporting": [
    "Register within 48 hours of residence, job, or school change.",
    "Return for annual or quarterly verification as required.",
    "Report name, address, employment, or school changes within 48 hours.",
    "Report new online accounts, usernames, or emails within 3 days."
  ],

  "verificationInPerson": [
    "Quarterly verification for violent offenders.",
    "Annual verification for non-violent offenders.",
    "Monthly reporting for homeless registrants.",
    "Fingerprinting and updated photos are required periodically."
  ],

  "residencyPresence": "Registrants with minor victims may not live or work within 1,000 feet of schools, parks, playgrounds, or daycare centers. Living within 1,000 feet of a victim or their family is prohibited.",

  "employmentEducationInternet": [
    "Cannot work or volunteer with direct, unsupervised access to minors.",
    "Must report job or school changes within 48 hours.",
    "Cannot portray characters (e.g., Santa, clown) to attract minors."
  ],

  "publicWebsiteExposure": [
    "The public site lists offender details, offenses, addresses, and photos. Victim identities are excluded.",
    "Some registrants (juvenile or limited-duration) may not appear online."
  ],

  "travelInterstate": [
    "Moving out of TN: notify authorities 48 hours before leaving.",
    "International travel: provide at least 21 days’ notice (or as soon as possible for emergencies)."
  ],

  "visitingTraveling": [
    "Staying 5 consecutive days establishes residency.",
    "Visiting 14 days in a year (or 4 in a month) triggers registration as a secondary residence.",
    "Travelers should register within 48 hours if thresholds are met."
  ],

  "complianceEnforcement": "Failure to register, report, or update is a Class E felony with mandatory minimum jail terms: 90 days (first), 180 days (second), and 1 year (third or more). Each day of non-compliance may count separately.",

  "reliefPaths": [
    "Sexual offenders may request removal after 10 years of compliance.",
    "Violent or repeat offenders are lifetime registrants.",
    "Expungement of the conviction (rare) results in immediate removal."
  ],

  "specialPopulations": [
    "Homeless registrants: monthly check-ins required.",
    "Juvenile offenders: may be required to register only if tried as adults.",
    "Multiple offenders may not reside in the same dwelling (limit: 2)."
  ],

  "costs": [
    "Annual or quarterly registration fee up to $150.",
    "State-issued offender ID card required; free if indigent.",
    "Failure to obtain proper ID within 60 days is a felony."
  ],

  "resources": {
    "legalAid": [
      { "name": "Tennessee Bureau of Investigation SOR Unit", "link": "https://www.tn.gov/tbi/divisions/cjis-division/tennessee-sex-offender-registry.html" }
    ],
    "advocacy": [
      { "name": "NARSOL Tennessee Affiliate", "link": "https://narsol.org/affiliate/tennessee/" }
    ],
    "reentry": [
      { "name": "Tennessee Department of Correction Reentry Programs", "link": "https://www.tn.gov/correction" }
    ]
  },

  "citations": [
    "[TCA §40-39-201 et seq.](https://law.justia.com/codes/tennessee/title-40/chapter-39/)",
    "[TCA §40-39-203 (registration and verification)](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-203/)",
    "[TCA §40-39-204 (violations)](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-204/)",
    "[TCA §40-39-207 (duration of registration)](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-207/)",
    "[TCA §40-39-211 (residency and employment restrictions)](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-211/)"
  ],

  "badges": {
    "residencyZones": true,
    "lifetimePossible": true,
    "verificationQuarterly": true
  },

  "plainLanguage": {
    "summary": [
      "Tennessee’s registry system is among the strictest in the U.S., with tight deadlines and broad definitions of residence.",
      "Visitors or new residents should err on the side of caution and register promptly to avoid felony penalties."
    ],
    "watchOuts": [
      "48-hour and 3-day update windows are unforgiving.",
      "Homeless or transient individuals must check in monthly."
    ],
    "validationNote": "Verified with [TCA §40-39-203](https://law.justia.com/codes/tennessee/title-40/chapter-39/part-2/section-40-39-203/) and [TBI SOR Unit](https://www.tn.gov/tbi/divisions/cjis-division/tennessee-sex-offender-registry.html). Please contact SOLAR if updates or corrections are needed."
  },

  "disclaimer": "This guide summarizes Tennessee’s sex offender registry laws in accessible language. It is not legal advice. Statutes change often—always verify with the Tennessee Bureau of Investigation or an attorney. Content validated with the help of AI; let us know if you believe something is inaccurate."
}